app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "link", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "picture" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["picture", "07_-_DcnvvIq.jpg"], ["updated_at", "2015-05-23 22:24:27.449241"], ["id", 1]]